---
type: ColorFillLegend
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ColorFillLegend

`Autodesk.Revit.DB.ColorFillLegend` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2022 | `public static ColorFillLegend Create ( Document document , ElementId viewId , ElementId catetoryId , XYZ origin )` |
| Method | GetColumnWidths | 2022 | `public IList < double > GetColumnWidths ()` |
| Method | SetColumnWidths | 2022 | `public void SetColumnWidths ( IList < double > widths )` |
| Property | ColorFillCategoryId | 2022 | `public ElementId ColorFillCategoryId { get ; }` |
| Property | Height | 2022 | `public double Height { get ; set ; }` |
| Property | Origin | 2022 | `public XYZ Origin { get ; set ; }` |
| Property | Parameter | — | `` |